## Agregación de datos por categoría

In [8]:
# Agregar datos es combinar con algun criterio el mas tipico es una varibale categorica para junatar todo la informacion de una misma categoria.
# Es comun utilizar variables categoricas y tomar una decision de donde pertenece cada elemento.

In [9]:
import numpy as np
import pandas as pd

In [10]:
gender = ["Male", "Female"]
income = ["Poor", "Middle Class", "Rich"]

In [11]:


n = 500 # tamaño del dataset

gender_data = []
income_data = []

for i in range(0,500):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [12]:
gender_data[1:10]

['Female',
 'Male',
 'Female',
 'Female',
 'Female',
 'Female',
 'Female',
 'Female',
 'Male']

In [13]:
income_data[1:10]

['Middle Class',
 'Rich',
 'Rich',
 'Rich',
 'Rich',
 'Middle Class',
 'Poor',
 'Rich',
 'Poor']

In [14]:
#Z -> N(0,1)
#N(m, s) -> m + s * Z
height = 160 + 30 * np.random.randn(n) # dist normal, media=160 y dispercion=30
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.rand(n)

In [15]:
data = pd.DataFrame(
    {
        "Gender" : gender_data,
        "Economic Status" : income_data,
        "Height" : height,
        "Weight" : weight,
        "Age" : age,
        "Income" : income
    }
)

In [17]:
data.head()

   Gender Economic Status      Height     Weight        Age        Income
0    Male            Poor  157.069589  73.369844  18.689996  20616.067072
1  Female    Middle Class  202.433766  45.754030  17.890561  21254.426357
2    Male            Rich  207.786588  53.579648  38.889537  21236.220662
3  Female            Rich  188.042725  38.534451  32.639086  18666.904711
4  Female            Rich  185.439287  92.383559  22.089621  18897.096895

## Agrupación de datos

In [18]:
grouped_gender = data.groupby("Gender")

In [19]:
grouped_gender.groups

{'Female': Int64Index([  1,   3,   4,   5,   6,   7,   8,  12,  13,  15,
             ...
             482, 484, 485, 486, 487, 492, 493, 495, 497, 498],
            dtype='int64', length=250),
 'Male': Int64Index([  0,   2,   9,  10,  11,  14,  18,  19,  20,  21,
             ...
             479, 481, 483, 488, 489, 490, 491, 494, 496, 499],
            dtype='int64', length=250)}

In [20]:
for names, groups in grouped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status      Height     Weight        Age        Income
1    Female    Middle Class  202.433766  45.754030  17.890561  21254.426357
3    Female            Rich  188.042725  38.534451  32.639086  18666.904711
4    Female            Rich  185.439287  92.383559  22.089621  18897.096895
5    Female            Rich  173.148977  85.730922   1.266733  20931.691191
6    Female    Middle Class  132.942851  43.900497   8.406752  18568.563862
..      ...             ...         ...        ...        ...           ...
492  Female            Poor  143.255938  84.021195  34.756760  18593.795075
493  Female    Middle Class  193.223295  99.816443  30.704576  19169.430470
495  Female    Middle Class  188.641489  52.301432  39.321979  19258.961377
497  Female    Middle Class  176.578614  92.220147  38.688200  19420.216821
498  Female            Poor  181.994752  45.401364  27.299249  19045.033729

[250 rows x 6 columns]
Male
    Gender Economic Status      Height      Weight        Age        Income
0     Male            Poor  157.069589   73.369844  18.689996  20616.067072
2     Male            Rich  207.786588   53.579648  38.889537  21236.220662
9     Male            Poor  188.716178   27.159243   1.071640  18844.836107
10    Male            Poor  143.685243   37.908016  42.038215  19336.726581
11    Male            Poor  138.742345   96.205998  20.089603  19952.981612
..     ...             ...         ...         ...        ...           ...
490   Male            Poor  224.203213  108.277344  13.422081  20880.053791
491   Male            Poor  145.894851   41.557700  40.575786  18408.174086
494   Male            Rich  154.063403   93.157485  37.729039  21155.021263
496   Male            Rich  146.586742   92.556557  47.321205  18401.729653
499   Male            Poor  190.624272   41.855269  21.565566  18400.361489

[250 rows x 6 columns]

In [21]:
grouped_gender.get_group("Female") #para mostrar un grupo en espesifico

     Gender Economic Status      Height     Weight        Age        Income
1    Female    Middle Class  202.433766  45.754030  17.890561  21254.426357
3    Female            Rich  188.042725  38.534451  32.639086  18666.904711
4    Female            Rich  185.439287  92.383559  22.089621  18897.096895
5    Female            Rich  173.148977  85.730922   1.266733  20931.691191
6    Female    Middle Class  132.942851  43.900497   8.406752  18568.563862
..      ...             ...         ...        ...        ...           ...
492  Female            Poor  143.255938  84.021195  34.756760  18593.795075
493  Female    Middle Class  193.223295  99.816443  30.704576  19169.430470
495  Female    Middle Class  188.641489  52.301432  39.321979  19258.961377
497  Female    Middle Class  176.578614  92.220147  38.688200  19420.216821
498  Female            Poor  181.994752  45.401364  27.299249  19045.033729

[250 rows x 6 columns]

In [22]:
double_group = data.groupby(["Gender", "Economic Status"])

In [23]:
len(double_group)

6

In [24]:
for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height      Weight        Age        Income
1    Female    Middle Class  202.433766   45.754030  17.890561  21254.426357
6    Female    Middle Class  132.942851   43.900497   8.406752  18568.563862
15   Female    Middle Class  115.622003   87.220731  25.401193  20399.622889
16   Female    Middle Class  155.400657   61.859987   5.878813  21449.359098
23   Female    Middle Class  183.848605  106.853930  31.197049  19751.062218
..      ...             ...         ...         ...        ...           ...
474  Female    Middle Class  133.662842   24.417155  22.135716  19878.560603
478  Female    Middle Class  166.263011   50.627325  25.006754  20692.181467
493  Female    Middle Class  193.223295   99.816443  30.704576  19169.430470
495  Female    Middle Class  188.641489   52.301432  39.321979  19258.961377
497  Female    Middle Class  176.578614   92.220147  38.688200  19420.216821

[85 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height      Weight        Age        Income
7    Female            Poor  192.367471   70.267435  31.251128  19708.321445
13   Female            Poor  130.261401   61.869945  18.848897  20145.455998
26   Female            Poor  170.124520   75.659390  33.747301  21429.644902
35   Female            Poor  129.812366   98.142368  41.172077  19390.876664
42   Female            Poor  138.877336  105.746517  12.744665  19795.151419
..      ...             ...         ...         ...        ...           ...
470  Female            Poor  173.602422   55.774501  23.351444  18045.781926
484  Female            Poor  142.740929   57.262516  28.165025  18816.852568
487  Female            Poor  160.370985   85.186512  24.918944  19849.723688
492  Female            Poor  143.255938   84.021195  34.756760  18593.795075
498  Female            Poor  181.994752   45.401364  27.299249  19045.033729

[78 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height      Weight        Age        Income
3    Female            Rich  188.042725   38.534451  32.639086  18666.904711
4    Female            Rich  185.439287   92.383559  22.089621  18897.096895
5    Female            Rich  173.148977   85.730922   1.266733  20931.691191
8    Female            Rich  156.817701   71.721788  51.655502  18044.137493
12   Female            Rich  145.624944   77.711858  18.524683  21155.628137
..      ...             ...         ...         ...        ...           ...
475  Female            Rich  179.472332   90.574865  16.215446  20592.893058
480  Female            Rich  193.369358   75.890416  22.065269  19173.893852
482  Female            Rich  123.223053   86.621844  52.647734  20049.406529
485  Female            Rich  146.942167  107.949161  33.906914  20664.219385
486  Female            Rich  119.608363   65.869562  33.985223  18295.197991

[87 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height     Weight        Age        Income
21    Male    Middle Class  141.842404  83.456016  14.616040  21430.638923
28    Male    Middle Class  162.132770   5.442116  38.274984  18962.157503
39    Male    Middle Class  108.954351  98.882342  15.892242  21037.853541
43    Male    Middle Class  204.146228  16.851231  44.984984  18352.822946
44    Male    Middle Class  147.783602  66.402597  30.472528  18306.834202
..     ...             ...         ...        ...        ...           ...
466   Male    Middle Class  144.251696  35.427910  41.632442  18398.496907
473   Male    Middle Class  176.735043  88.662736  35.741097  19371.156386
476   Male    Middle Class  152.729402  71.519198  16.936181  21344.074387
483   Male    Middle Class  176.568201  34.306683  13.355543  18387.424389
489   Male    Middle Class  172.901050  48.826260  16.861539  21008.988172

[86 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height      Weight        Age        Income
0     Male            Poor  157.069589   73.369844  18.689996  20616.067072
9     Male            Poor  188.716178   27.159243   1.071640  18844.836107
10    Male            Poor  143.685243   37.908016  42.038215  19336.726581
11    Male            Poor  138.742345   96.205998  20.089603  19952.981612
14    Male            Poor  198.137704   45.624088  30.867493  19253.463297
..     ...             ...         ...         ...        ...           ...
471   Male            Poor  199.053686  105.303849  10.729671  18123.646133
481   Male            Poor  168.367531   85.370172  33.567730  20974.419741
490   Male            Poor  224.203213  108.277344  13.422081  20880.053791
491   Male            Poor  145.894851   41.557700  40.575786  18408.174086
499   Male            Poor  190.624272   41.855269  21.565566  18400.361489

[79 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height     Weight        Age        Income
2     Male            Rich  207.786588  53.579648  38.889537  21236.220662
25    Male            Rich  154.773931  63.759329  55.983524  19766.543303
32    Male            Rich  197.909478  72.711988   8.617282  18121.698375
34    Male            Rich  191.218174  60.648958  31.900531  18729.163795
37    Male            Rich  164.603150  58.295856  43.611211  19598.251718
..     ...             ...         ...        ...        ...           ...
477   Male            Rich  147.040594  41.879675  31.837552  21259.067776
479   Male            Rich  128.774581  36.172580   8.949263  19040.732376
488   Male            Rich  163.673260  26.944384  12.944336  19972.287698
494   Male            Rich  154.063403  93.157485  37.729039  21155.021263
496   Male            Rich  146.586742  92.556557  47.321205  18401.729653

[85 rows x 6 columns]